Autodesk.Navisworks.Api.DocumentParts.ModelItemPathId
Represent a combined id with model index and the path identifier.

Autodesk.Navisworks.Api.DocumentParts.ModelItemPathId.#ctor
Constructor for a ModelItemPathId.

Autodesk.Navisworks.Api.DocumentParts.ModelItemPathId.ModelIndex
The model index

Autodesk.Navisworks.Api.DocumentParts.ModelItemPathId.PathId
The path identifier